app/controllers/solicituds_controller.rb

  def create
    unless authorize_page(session[:tipo_usuario],"Vendedor")
      flash[:error] = "Acceso no autorizado"
      redirect_to login_path
      false
    end
    @solicitud = Solicitud.new(solicitud_params)
    @solicitud.vendedor_id = session[:usuario_id]
    @solicitud.estado = 0
    @solicitud.fecha = Date.today
    #@archivo = Attachment.new(attachment_params)
    unless solicitud_params[:adjunto]
      #@archivo.save
      @solicitud.archivo_id = @archivo.id
    end
    respond_to do |format|
      if @solicitud.save
---
INSERT INTO "solicituds" ("cliente", "disenador_id", "linea", "tipo", "set_tallas", "contramuestra", "referencia", "muestra_tela", "nombre_tela", "adjunto", "cantidad", "especificacion", "fecha", "vendedor_id", "estado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @solicitud.update(solicitud_params)
---
UPDATE "solicituds" SET "especificacion" = ?, "updated_at" = ? WHERE "solicituds"."id" = ?  [["especificacion", "iu"], ["updated_at", "2015-03-24 21:36:24.363456"], ["id", 10]]

  def destroy
     unless authorize_page(session[:tipo_usuario],"Administrador")
      flash[:error] = "Acceso no autorizado"
      redirect_to login_path
      false
    end
    @solicitud.destroy
---
DELETE FROM "solicituds" WHERE "solicituds"."id" = ?  [["id", 1]]

    def set_solicitud
      @solicitud = Solicitud.find(params[:id])
---
SELECT  "solicituds".* FROM "solicituds" WHERE "solicituds"."id" = ? LIMIT 1  [["id", 10]]