app/controllers/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios"
---
  def index
    unless authorize_page(session[:tipo_usuario],"Administrador")
      flash[:error] = "Acceso no autorizado"
      redirect_to login_path
      false
    end

    @usuarios = Usuario.all

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    unless authorize_page(session[:tipo_usuario],"Administrador")
      flash[:error] = "Acceso no autorizado"
      redirect_to login_path
      false
    end
    @usuario = Usuario.find(params[:id])

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @usuario = Usuario.find(params[:id])

UPDATE "usuarios" SET "apellido" = ?, "clave" = ?, "correo" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["apellido", "lopez"], ["clave", ""], ["correo", "sebas@hot.com"], ["updated_at", "2015-03-23 22:01:44.935301"], ["id", 1]]
---
  def update
    unless authorize_page(session[:tipo_usuario],"Administrador")
      flash[:error] = "Acceso no autorizado"
      redirect_to login_path
      false
    end
    @usuario = get_usuario(params[:id])
    respond_to do |format|
      if @usuario.update(usuario_params)